<template>
  <div class="EmergencyMeasure">
    <page-header class="mb-3">
      {{ $t('茨城県独自の緊急事態宣言について') }}
    </page-header>
    <static-card>
      <h2>{{ $t('対象地域と期間') }}</h2>
      <p>
        {{ $t('県内全域が対象。') }}<br />{{
          $t('期間は2021年1月18日から2月28日まで（延長の可能性あり）。')
        }}
      </p>
    </static-card>
    <h2 class="mb-3">{{ $t('緊急事態宣言の内容') }}</h2>
    <static-card>
      <h3>{{ $t('不要不急の外出自粛要請') }}</h3>
      <p>{{ $t('県内全域に対して、不要不急の外出・移動の自粛を要請。') }}</p>
    </static-card>
    <static-card>
      <h3>{{ $t('飲食店の営業時間短縮要請') }}</h3>
      <p>{{ $t('県内すべての飲食店に対して、20時～翌5時の営業自粛を要請') }}</p>
      <p>
        {{
          $t(
            'ただし、酒類の提供は19時まで。テイクアウトおよびデリバリーは20時以降も営業可。'
          )
        }}
      </p>
      <p>
        {{
          $t(
            '要請期間のすべてにご協力いただいた店舗には、協力金が支給される予定。支給額は「1店舗当たり4万円/日」で計算。'
          )
        }}<br />問い合わせは
        <a href="tel:029-301-5393"
          >茨城県 営業時間短縮要請及び協力金問い合わせ窓口</a
        >へ（受付時間は9時～17時）。
      </p>
    </static-card>
    <static-card>
      <h3>{{ $t('アマビエちゃんの利用推進') }}</h3>
      <p>
        {{ $t('事業者の方は、いばらきアマビエちゃんの店舗登録をする。')
        }}<br />{{
          $t(
            '入店される方に対し、いばらきアマビエちゃんの利用登録を要請する。'
          )
        }}{{ $t('アマビエちゃんの利用登録ができない場合には、連絡先を聞く。') }}
      </p>
      <p>
        {{
          $t(
            '利用者の方は、いばらきアマビエちゃんに登録されている店舗を利用する。'
          )
        }}{{
          $t(
            '店舗を利用する際には、その都度いばらきアマビエちゃんの利用登録を行う。'
          )
        }}
      </p>
    </static-card>
    <static-card>
      <h3>{{ $t('催し物の開催制限') }}</h3>
      <p>
        {{
          $t(
            'イベントなどの催し物を開催する場合、人数上限5,000人、かつ収容率50%以下とすることを要請。'
          )
        }}
      </p>
      <p>
        {{ $t('例1. 最大収容人数3,000人→収容率50%の1,500人（&lt; 5,000人）')
        }}<br />{{
          $t('例2. 最大収容人数20,000人→人数上限の5,000人（収容率 25%）')
        }}
      </p>
      <p>{{ $t('COCOA、いばらきアマビエちゃんの利用登録も行う。') }}</p>
    </static-card>
    <static-card>
      <h3>{{ $t('出勤者数の削減') }}</h3>
      <p>
        {{
          $t(
            'テレワークを積極的に活用し、できるだけ出勤職員数を削減することを要請。'
          )
        }}<br />{{ $t('混雑緩和のため、時差出勤の活用を要請。') }}
      </p>
    </static-card>
    <static-card>
      <h3>{{ $t('部活動の制限') }}</h3>
      <p>
        {{ $t('大会は、主催団体に延期もしくは中止を要請。') }}<br />{{
          $t('学校には、他校との練習試合、合宿などの中止を要請。')
        }}
      </p>
      <p>
        {{ $t('感染症対策を徹底したうえで、自校のみの活動を行う。') }}<br />{{
          $t('その他の学校活動は、通常通り感染対策に注意しながら継続。')
        }}
      </p>
    </static-card>
    <static-card>
      <h3>{{ $t('県有施設の営業自粛') }}</h3>
      <p>
        {{ $t('県有施設はすべて休館（県立図書館を除く）。') }}<br />{{
          $t('県有宿泊施設は、新規予約受付を中止。')
        }}
      </p>
      <p>
        {{
          $t(
            '2/8より、感染対策を講じたうえで順次営業再開。宿泊施設に関しては、国の緊急事態宣言対象地域からの来県をのぞき、順次予約受付再開。'
          )
        }}
      </p>
    </static-card>
    <static-card>
      <h3>{{ $t('社会福祉施設従業員の検査') }}</h3>
      <p>
        {{
          $t(
            '福祉施設におけるクラスター発生の可能性を減らすため、従事者に対し緊急検査を実施'
          )
        }}
      </p>
    </static-card>
  </div>
</template>

<script lang="ts">
import Vue from 'vue'
import { MetaInfo } from 'vue-meta'

import PageHeader from '@/components/PageHeader.vue'
import StaticCard from '@/components/StaticCard.vue'

export default Vue.extend({
  components: {
    PageHeader,
    StaticCard,
  },
  head(): MetaInfo {
    return {
      title: this.$t('茨城県独自の緊急事態宣言について') as string,
    }
  },
})
</script>
